'use strict'

/*Вас попросили написать JavaScript-код для автоматической
системы управления кинотеатром. Задача состоит в том,
чтобы опре делить, пускать ли зрителя на фильм «с 12 лет
и старше» или нет.
Правила таковы: если посетителю 12 лет или больше,
он может проходить. Если ему еще не исполнилось 12, но его
сопровождает взрослый, пусть тоже проходит. Во всех
остальных случаях вход запрещен.*/


var age = 11;
var accompanied = true;
var enterAge;
enterAge === age >= 12 || age < 12 + accompanied;








