"use strict"
/*Цикл for для массивов в JavaScript
Задача 2
В следующем коде программист вывел в консоль все элементы массива:
В коде, однако, была допущена ошибка, которая привела к тому, что в последней итерации цикла почему-то выводится undefined, а не элемент массива.
Исправьте ошибку программиста. Объясните, в чем он был не прав.*/




/* let arr = [1, 2, 3, 4, 5];

for (let i = 0; i <= arr.length; i++) {
	console.log(arr[i]);
} */

let arr = [1, 2, 3, 4, 5];

	for (let i = 0; i < arr.length; i++) // изменил '<='  на '<'.
	{
		console.log(arr[i]);
	}
