"use strict"
/*Проверка значения из диапазона
Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.

Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого оператора.*/



/*if (!(age >= 14 && age <= 90))

if (age < 14 || age > 90)
*/



/*let age = 13;
	if (!(age >= 14 && age <= 90)){
		console.log('не в диапозоне');
	}else{
		console.log('в диапозоне');
	}
*/





/*let age = 15;
	if (age >= 14 && age <= 90){
		console.log('в диапозоне');
	}else{
		console.log('не в диапозоне');
	}
*/
